import React from 'react'
import Header from "../wedgits/Header";
import Footer from "../wedgits/Footer";
import "../css/HomePage.scss";
import Slider from "../wedgits/Slider";
import Swaper from "../wedgits/Swaper";

export default function Category() {
  return (
    <div className="mainContainer">
    <Header/>
    <div className="mainContent">
        <div className="bannerContainer">
            <Slider/>
        </div>
        <br/>
        <div className="crucelContainer">
            <Swaper/>
        </div>

        <br/>

        <div className="favoriteMobileContainer">
            <div style={{display: "flex"}}>
                <button className="favoriteMobileBtn">
                    محبوب‌ ترین برند موبایل
                </button>
            </div>
            <br/>
            <div style={{display: "flex"}}>
                <div className="brandsCardContainer">
                    <div className="brandsCard">
                        <svg width="80" height="97" viewBox="0 0 80 97" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <g id="Layer_1" clip-path="url(#clip0_9_234)">
                                <path id="Vector"
                                      d="M59.3752 0.125C59.9253 6.15861 57.9385 11.3367 53.9936 15.8548C52.0602 18.0669 49.8886 19.9695 47.1301 21.1388C44.856 22.1002 42.4956 22.4017 39.9793 22.1939C39.7535 19.0773 40.1476 16.0829 41.4201 13.2474C44.6097 6.15861 50.1349 1.93386 57.7373 0.296108C57.8482 0.271664 57.9508 0.182036 58.0534 0.125C58.4926 0.125 58.936 0.125 59.3752 0.125Z"
                                      fill="#0F0000"/>
                                <path id="Vector_2"
                                      d="M76.9855 32.8841C69.7361 37.447 66.0499 43.8228 66.6779 52.4964C67.306 61.117 71.8953 66.8817 79.625 70.5728C79.1529 71.8154 78.7506 73.0213 78.2498 74.1864C75.3804 80.876 71.5382 86.9585 66.4768 92.2302C64.2847 94.5117 61.5672 95.905 58.2997 95.9824C55.9722 96.0354 53.7637 95.4609 51.5963 94.6787C49.708 93.9984 47.8362 93.261 45.9068 92.7313C42.4669 91.7862 39.0638 92.1976 35.7224 93.3261C33.321 94.1369 30.936 95.0169 28.5059 95.738C25.4682 96.6383 22.685 95.8928 20.0907 94.1939C17.9356 92.7802 16.1828 90.9469 14.5818 88.9751C8.0919 81.0063 3.66265 72.0557 1.70869 61.9522C0.477197 55.5804 0.0379654 49.1965 1.79489 42.8532C3.91716 35.1941 8.12474 29.1279 15.526 25.5876C20.5505 23.188 25.7104 22.8295 30.9935 24.6302C33.3662 25.4368 35.7142 26.3209 38.0622 27.1968C39.9628 27.9057 41.7813 27.6531 43.6614 27.0012C47.0932 25.8116 50.4962 24.288 54.0429 23.7339C63.1436 22.3202 70.9512 24.8379 76.6735 32.4034C76.7679 32.5256 76.8418 32.66 76.9896 32.8841H76.9855Z"
                                      fill="#0F0000"/>
                            </g>
                            <defs>
                                <clipPath id="clip0_9_234">
                                    <rect width="79" height="96" fill="white"
                                          transform="translate(0.625 0.125)"/>
                                </clipPath>
                            </defs>
                        </svg>
                    </div>
                    <div className="brandsCard">
                        <svg width="80" height="97" viewBox="0 0 80 97" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <g id="Layer_1" clip-path="url(#clip0_9_234)">
                                <path id="Vector"
                                      d="M59.3752 0.125C59.9253 6.15861 57.9385 11.3367 53.9936 15.8548C52.0602 18.0669 49.8886 19.9695 47.1301 21.1388C44.856 22.1002 42.4956 22.4017 39.9793 22.1939C39.7535 19.0773 40.1476 16.0829 41.4201 13.2474C44.6097 6.15861 50.1349 1.93386 57.7373 0.296108C57.8482 0.271664 57.9508 0.182036 58.0534 0.125C58.4926 0.125 58.936 0.125 59.3752 0.125Z"
                                      fill="#0F0000"/>
                                <path id="Vector_2"
                                      d="M76.9855 32.8841C69.7361 37.447 66.0499 43.8228 66.6779 52.4964C67.306 61.117 71.8953 66.8817 79.625 70.5728C79.1529 71.8154 78.7506 73.0213 78.2498 74.1864C75.3804 80.876 71.5382 86.9585 66.4768 92.2302C64.2847 94.5117 61.5672 95.905 58.2997 95.9824C55.9722 96.0354 53.7637 95.4609 51.5963 94.6787C49.708 93.9984 47.8362 93.261 45.9068 92.7313C42.4669 91.7862 39.0638 92.1976 35.7224 93.3261C33.321 94.1369 30.936 95.0169 28.5059 95.738C25.4682 96.6383 22.685 95.8928 20.0907 94.1939C17.9356 92.7802 16.1828 90.9469 14.5818 88.9751C8.0919 81.0063 3.66265 72.0557 1.70869 61.9522C0.477197 55.5804 0.0379654 49.1965 1.79489 42.8532C3.91716 35.1941 8.12474 29.1279 15.526 25.5876C20.5505 23.188 25.7104 22.8295 30.9935 24.6302C33.3662 25.4368 35.7142 26.3209 38.0622 27.1968C39.9628 27.9057 41.7813 27.6531 43.6614 27.0012C47.0932 25.8116 50.4962 24.288 54.0429 23.7339C63.1436 22.3202 70.9512 24.8379 76.6735 32.4034C76.7679 32.5256 76.8418 32.66 76.9896 32.8841H76.9855Z"
                                      fill="#0F0000"/>
                            </g>
                            <defs>
                                <clipPath id="clip0_9_234">
                                    <rect width="79" height="96" fill="white"
                                          transform="translate(0.625 0.125)"/>
                                </clipPath>
                            </defs>
                        </svg>
                    </div>
                    <div className="brandsCard">
                        <svg width="80" height="97" viewBox="0 0 80 97" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <g id="Layer_1" clip-path="url(#clip0_9_234)">
                                <path id="Vector"
                                      d="M59.3752 0.125C59.9253 6.15861 57.9385 11.3367 53.9936 15.8548C52.0602 18.0669 49.8886 19.9695 47.1301 21.1388C44.856 22.1002 42.4956 22.4017 39.9793 22.1939C39.7535 19.0773 40.1476 16.0829 41.4201 13.2474C44.6097 6.15861 50.1349 1.93386 57.7373 0.296108C57.8482 0.271664 57.9508 0.182036 58.0534 0.125C58.4926 0.125 58.936 0.125 59.3752 0.125Z"
                                      fill="#0F0000"/>
                                <path id="Vector_2"
                                      d="M76.9855 32.8841C69.7361 37.447 66.0499 43.8228 66.6779 52.4964C67.306 61.117 71.8953 66.8817 79.625 70.5728C79.1529 71.8154 78.7506 73.0213 78.2498 74.1864C75.3804 80.876 71.5382 86.9585 66.4768 92.2302C64.2847 94.5117 61.5672 95.905 58.2997 95.9824C55.9722 96.0354 53.7637 95.4609 51.5963 94.6787C49.708 93.9984 47.8362 93.261 45.9068 92.7313C42.4669 91.7862 39.0638 92.1976 35.7224 93.3261C33.321 94.1369 30.936 95.0169 28.5059 95.738C25.4682 96.6383 22.685 95.8928 20.0907 94.1939C17.9356 92.7802 16.1828 90.9469 14.5818 88.9751C8.0919 81.0063 3.66265 72.0557 1.70869 61.9522C0.477197 55.5804 0.0379654 49.1965 1.79489 42.8532C3.91716 35.1941 8.12474 29.1279 15.526 25.5876C20.5505 23.188 25.7104 22.8295 30.9935 24.6302C33.3662 25.4368 35.7142 26.3209 38.0622 27.1968C39.9628 27.9057 41.7813 27.6531 43.6614 27.0012C47.0932 25.8116 50.4962 24.288 54.0429 23.7339C63.1436 22.3202 70.9512 24.8379 76.6735 32.4034C76.7679 32.5256 76.8418 32.66 76.9896 32.8841H76.9855Z"
                                      fill="#0F0000"/>
                            </g>
                            <defs>
                                <clipPath id="clip0_9_234">
                                    <rect width="79" height="96" fill="white"
                                          transform="translate(0.625 0.125)"/>
                                </clipPath>
                            </defs>
                        </svg>
                    </div>
                    <div className="brandsCard">
                        <svg width="80" height="97" viewBox="0 0 80 97" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <g id="Layer_1" clip-path="url(#clip0_9_234)">
                                <path id="Vector"
                                      d="M59.3752 0.125C59.9253 6.15861 57.9385 11.3367 53.9936 15.8548C52.0602 18.0669 49.8886 19.9695 47.1301 21.1388C44.856 22.1002 42.4956 22.4017 39.9793 22.1939C39.7535 19.0773 40.1476 16.0829 41.4201 13.2474C44.6097 6.15861 50.1349 1.93386 57.7373 0.296108C57.8482 0.271664 57.9508 0.182036 58.0534 0.125C58.4926 0.125 58.936 0.125 59.3752 0.125Z"
                                      fill="#0F0000"/>
                                <path id="Vector_2"
                                      d="M76.9855 32.8841C69.7361 37.447 66.0499 43.8228 66.6779 52.4964C67.306 61.117 71.8953 66.8817 79.625 70.5728C79.1529 71.8154 78.7506 73.0213 78.2498 74.1864C75.3804 80.876 71.5382 86.9585 66.4768 92.2302C64.2847 94.5117 61.5672 95.905 58.2997 95.9824C55.9722 96.0354 53.7637 95.4609 51.5963 94.6787C49.708 93.9984 47.8362 93.261 45.9068 92.7313C42.4669 91.7862 39.0638 92.1976 35.7224 93.3261C33.321 94.1369 30.936 95.0169 28.5059 95.738C25.4682 96.6383 22.685 95.8928 20.0907 94.1939C17.9356 92.7802 16.1828 90.9469 14.5818 88.9751C8.0919 81.0063 3.66265 72.0557 1.70869 61.9522C0.477197 55.5804 0.0379654 49.1965 1.79489 42.8532C3.91716 35.1941 8.12474 29.1279 15.526 25.5876C20.5505 23.188 25.7104 22.8295 30.9935 24.6302C33.3662 25.4368 35.7142 26.3209 38.0622 27.1968C39.9628 27.9057 41.7813 27.6531 43.6614 27.0012C47.0932 25.8116 50.4962 24.288 54.0429 23.7339C63.1436 22.3202 70.9512 24.8379 76.6735 32.4034C76.7679 32.5256 76.8418 32.66 76.9896 32.8841H76.9855Z"
                                      fill="#0F0000"/>
                            </g>
                            <defs>
                                <clipPath id="clip0_9_234">
                                    <rect width="79" height="96" fill="white"
                                          transform="translate(0.625 0.125)"/>
                                </clipPath>
                            </defs>
                        </svg>
                    </div>
                    <div className="brandsCard">
                        <svg width="80" height="97" viewBox="0 0 80 97" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <g id="Layer_1" clip-path="url(#clip0_9_234)">
                                <path id="Vector"
                                      d="M59.3752 0.125C59.9253 6.15861 57.9385 11.3367 53.9936 15.8548C52.0602 18.0669 49.8886 19.9695 47.1301 21.1388C44.856 22.1002 42.4956 22.4017 39.9793 22.1939C39.7535 19.0773 40.1476 16.0829 41.4201 13.2474C44.6097 6.15861 50.1349 1.93386 57.7373 0.296108C57.8482 0.271664 57.9508 0.182036 58.0534 0.125C58.4926 0.125 58.936 0.125 59.3752 0.125Z"
                                      fill="#0F0000"/>
                                <path id="Vector_2"
                                      d="M76.9855 32.8841C69.7361 37.447 66.0499 43.8228 66.6779 52.4964C67.306 61.117 71.8953 66.8817 79.625 70.5728C79.1529 71.8154 78.7506 73.0213 78.2498 74.1864C75.3804 80.876 71.5382 86.9585 66.4768 92.2302C64.2847 94.5117 61.5672 95.905 58.2997 95.9824C55.9722 96.0354 53.7637 95.4609 51.5963 94.6787C49.708 93.9984 47.8362 93.261 45.9068 92.7313C42.4669 91.7862 39.0638 92.1976 35.7224 93.3261C33.321 94.1369 30.936 95.0169 28.5059 95.738C25.4682 96.6383 22.685 95.8928 20.0907 94.1939C17.9356 92.7802 16.1828 90.9469 14.5818 88.9751C8.0919 81.0063 3.66265 72.0557 1.70869 61.9522C0.477197 55.5804 0.0379654 49.1965 1.79489 42.8532C3.91716 35.1941 8.12474 29.1279 15.526 25.5876C20.5505 23.188 25.7104 22.8295 30.9935 24.6302C33.3662 25.4368 35.7142 26.3209 38.0622 27.1968C39.9628 27.9057 41.7813 27.6531 43.6614 27.0012C47.0932 25.8116 50.4962 24.288 54.0429 23.7339C63.1436 22.3202 70.9512 24.8379 76.6735 32.4034C76.7679 32.5256 76.8418 32.66 76.9896 32.8841H76.9855Z"
                                      fill="#0F0000"/>
                            </g>
                            <defs>
                                <clipPath id="clip0_9_234">
                                    <rect width="79" height="96" fill="white"
                                          transform="translate(0.625 0.125)"/>
                                </clipPath>
                            </defs>
                        </svg>
                    </div>
                    <div className="brandsCard">
                        <svg width="80" height="97" viewBox="0 0 80 97" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <g id="Layer_1" clip-path="url(#clip0_9_234)">
                                <path id="Vector"
                                      d="M59.3752 0.125C59.9253 6.15861 57.9385 11.3367 53.9936 15.8548C52.0602 18.0669 49.8886 19.9695 47.1301 21.1388C44.856 22.1002 42.4956 22.4017 39.9793 22.1939C39.7535 19.0773 40.1476 16.0829 41.4201 13.2474C44.6097 6.15861 50.1349 1.93386 57.7373 0.296108C57.8482 0.271664 57.9508 0.182036 58.0534 0.125C58.4926 0.125 58.936 0.125 59.3752 0.125Z"
                                      fill="#0F0000"/>
                                <path id="Vector_2"
                                      d="M76.9855 32.8841C69.7361 37.447 66.0499 43.8228 66.6779 52.4964C67.306 61.117 71.8953 66.8817 79.625 70.5728C79.1529 71.8154 78.7506 73.0213 78.2498 74.1864C75.3804 80.876 71.5382 86.9585 66.4768 92.2302C64.2847 94.5117 61.5672 95.905 58.2997 95.9824C55.9722 96.0354 53.7637 95.4609 51.5963 94.6787C49.708 93.9984 47.8362 93.261 45.9068 92.7313C42.4669 91.7862 39.0638 92.1976 35.7224 93.3261C33.321 94.1369 30.936 95.0169 28.5059 95.738C25.4682 96.6383 22.685 95.8928 20.0907 94.1939C17.9356 92.7802 16.1828 90.9469 14.5818 88.9751C8.0919 81.0063 3.66265 72.0557 1.70869 61.9522C0.477197 55.5804 0.0379654 49.1965 1.79489 42.8532C3.91716 35.1941 8.12474 29.1279 15.526 25.5876C20.5505 23.188 25.7104 22.8295 30.9935 24.6302C33.3662 25.4368 35.7142 26.3209 38.0622 27.1968C39.9628 27.9057 41.7813 27.6531 43.6614 27.0012C47.0932 25.8116 50.4962 24.288 54.0429 23.7339C63.1436 22.3202 70.9512 24.8379 76.6735 32.4034C76.7679 32.5256 76.8418 32.66 76.9896 32.8841H76.9855Z"
                                      fill="#0F0000"/>
                            </g>
                            <defs>
                                <clipPath id="clip0_9_234">
                                    <rect width="79" height="96" fill="white"
                                          transform="translate(0.625 0.125)"/>
                                </clipPath>
                            </defs>
                        </svg>
                    </div>
                </div>
            </div>
        </div>

        <br/>
        <br/>

        <div className="BestSellingProducts">
            <div style={{display: "flex", justifyContent:"center"}}>
                <div className="cards btn">
                    <p>پرفروش‌ ترین محصولات</p>
                </div>
                <div className="cards">
                    <img src="./sample.jpeg"/>
                </div>
                <div className="cards">
                    <img src="./sample.jpeg"/>
                </div>
                <div className="cards">
                    <img src="./sample.jpeg"/>
                </div>
            </div>

            <div style={{display: "flex" , justifyContent:"center"}}>
                <div className="cards">
                    <img src="./sample.jpeg"/>
                </div>
                <div className="cards">
                    <img src="./sample.jpeg"/>
                </div>
                <div className="cards">
                    <img src="./sample.jpeg"/>
                </div>
                <div className="cards">
                    <img src="./sample.jpeg"/>
                </div>
            </div>
        </div>

        <br/>

        <div className="accessoriesContainer">
            <div style={{display: "flex"}}>
                <button className="accessoriesBtn">
                    لوازم جانبی
                </button>
            </div>
            <br/>
            <div style={{display: "flex"}}>
                <div className="accessoriesCardContainer">
                    <div className="brandsCard">
                        <img src="./Frame 20.png" alt=""/>
                    </div>
                    <div className="brandsCard">
                        <img src="./Frame 20.png" alt=""/>
                    </div>
                    <div className="brandsCard">
                        <img src="./Frame 20.png" alt=""/>
                    </div>
                    <div className="brandsCard">
                        <img src="./Frame 20.png" alt=""/>
                    </div>
                    <div className="brandsCard">
                        <img src="./Frame 20.png" alt=""/>
                    </div>
                    <div className="brandsCard">
                        <img src="./Frame 20.png" alt=""/>
                    </div>
                </div>
            </div>
        </div>

        <br/>
        <br/>

        <div className="merchandiseDataContainer">
            <div style={{display: "flex"}}>
                <button className="merchandiseDataBtn">
                    خواندنی‌ها
                </button>
            </div>
            <br/>
            <div style={{display: "flex"}}>
                <div className="merchandiseDataIssues">
                    <div className="DataIssue">
                        <div className="imgContainer">
                            <img src="./60138a1dd9c377e966222e080da79199.jpeg" alt="" />
                        </div>
                        <div className="textContainer">
                            <h4>بررسی لپ‌تاپ ایسر Swift Go 14؛ به شدت پرتابل و قدرتمند</h4>
                            <p>
                                این لپ‌تاپ با وجود استفاده از نمایشگر ۱۴ اینچی، بسیار کوچک و پرتابل محسوب
                                می‌شود. بیشتر نمایشگرهای لپ‌تاپ‌ها مبتنی بر پنل IPS هستند ولی لپ‌تاپ ایسر Swift
                                Go 14 از نمایشگر OLED با رزولوشن ۲۸۸۰ در ۱۸۰۰ بهره می‌برد. رفرش‌ریت نمایشگر به
                                ۹۰ هرتز می‌رسد و روشنایی ۵۰۰ نیت می‌تواند برای بسیاری از محیط‌ها کافی باشد.
                                این مدل از لپ‌تاپ، از پردازنده اینتل اولترا ۵ ۱۲۵H بهره می‌برد و در کنار آن ۱۶
                                گیگابایت رم DDR5 استفاده شده است. با وجود اینکه از گرافیک جداگانه برای آن
                                استفاده نشده، ولی گرافیک داخلی پردازنده به حدی قدرتمند است که می‌توانید بیشتر
                                بازی‌ها را اجرا کنید. این لپ‌تاپ مناسب کاربرانی است که می‌خواهند ساعت‌های زیادی
                                از لپ‌تاپ قدرتمند و پرتابل با خیال راحت استفاده کنند.
                            </p>
                        </div>
                    </div>
                    <div className="DataIssue">
                        <div className="imgContainer">
                            <img src="./60138a1dd9c377e966222e080da79199.jpeg" alt="" />
                        </div>
                        <div className="textContainer">
                            <h4>بررسی لپ‌تاپ ایسر Swift Go 14؛ به شدت پرتابل و قدرتمند</h4>
                            <p>
                                این لپ‌تاپ با وجود استفاده از نمایشگر ۱۴ اینچی، بسیار کوچک و پرتابل محسوب
                                می‌شود. بیشتر نمایشگرهای لپ‌تاپ‌ها مبتنی بر پنل IPS هستند ولی لپ‌تاپ ایسر Swift
                                Go 14 از نمایشگر OLED با رزولوشن ۲۸۸۰ در ۱۸۰۰ بهره می‌برد. رفرش‌ریت نمایشگر به
                                ۹۰ هرتز می‌رسد و روشنایی ۵۰۰ نیت می‌تواند برای بسیاری از محیط‌ها کافی باشد.
                                این مدل از لپ‌تاپ، از پردازنده اینتل اولترا ۵ ۱۲۵H بهره می‌برد و در کنار آن ۱۶
                                گیگابایت رم DDR5 استفاده شده است. با وجود اینکه از گرافیک جداگانه برای آن
                                استفاده نشده، ولی گرافیک داخلی پردازنده به حدی قدرتمند است که می‌توانید بیشتر
                                بازی‌ها را اجرا کنید. این لپ‌تاپ مناسب کاربرانی است که می‌خواهند ساعت‌های زیادی
                                از لپ‌تاپ قدرتمند و پرتابل با خیال راحت استفاده کنند.
                            </p>
                        </div>
                    </div>
                    <div className="DataIssue">
                        <div className="imgContainer">
                            <img src="./60138a1dd9c377e966222e080da79199.jpeg" alt="" />
                        </div>
                        <div className="textContainer">
                            <h4>بررسی لپ‌تاپ ایسر Swift Go 14؛ به شدت پرتابل و قدرتمند</h4>
                            <p>
                                این لپ‌تاپ با وجود استفاده از نمایشگر ۱۴ اینچی، بسیار کوچک و پرتابل محسوب
                                می‌شود. بیشتر نمایشگرهای لپ‌تاپ‌ها مبتنی بر پنل IPS هستند ولی لپ‌تاپ ایسر Swift
                                Go 14 از نمایشگر OLED با رزولوشن ۲۸۸۰ در ۱۸۰۰ بهره می‌برد. رفرش‌ریت نمایشگر به
                                ۹۰ هرتز می‌رسد و روشنایی ۵۰۰ نیت می‌تواند برای بسیاری از محیط‌ها کافی باشد.
                                این مدل از لپ‌تاپ، از پردازنده اینتل اولترا ۵ ۱۲۵H بهره می‌برد و در کنار آن ۱۶
                                گیگابایت رم DDR5 استفاده شده است. با وجود اینکه از گرافیک جداگانه برای آن
                                استفاده نشده، ولی گرافیک داخلی پردازنده به حدی قدرتمند است که می‌توانید بیشتر
                                بازی‌ها را اجرا کنید. این لپ‌تاپ مناسب کاربرانی است که می‌خواهند ساعت‌های زیادی
                                از لپ‌تاپ قدرتمند و پرتابل با خیال راحت استفاده کنند.
                            </p>
                        </div>
                    </div>
                </div>
                <div className="merchandiseDataImg">
                    <div style={{margin:"auto auto 0 auto" , zIndex:10}}>
                        <h5>بررسی لپ‌تاپ ایسر Swift Go 14؛ به شدت پرتابل و قدرتمند</h5>
                        <p>
                            این لپ‌تاپ با وجود استفاده از نمایشگر ۱۴ اینچی، بسیار کوچک و پرتابل محسوب می‌شود. بیشتر
                            نمایشگرهای لپ‌تاپ‌ها مبتنی بر پنل IPS هستند ولی لپ‌تاپ ایسر Swift Go 14 از نمایشگر OLED
                            با رزولوشن ۲۸۸۰ در ۱۸۰۰ بهره می‌برد. رفرش‌ریت نمایشگر به ۹۰ هرتز می‌رسد و روشنایی ۵۰۰
                            نیت می‌تواند برای بسیاری از محیط‌ها کافی باشد.
                            این مدل از لپ‌تاپ، از پردازنده اینتل اولترا ۵ ۱۲۵H بهره می‌برد و در کنار آن ۱۶ گیگابایت
                            رم DDR5 استفاده شده است. با وجود اینکه از گرافیک جداگانه برای آن استفاده نشده، ولی
                            گرافیک داخلی پردازنده به حدی قدرتمند است که می‌توانید بیشتر بازی‌ها را اجرا کنید. این
                            لپ‌تاپ مناسب کاربرانی است که می‌خواهند ساعت‌های زیادی از لپ‌تاپ قدرتمند و پرتابل با خیال
                            راحت استفاده کنند.
                        </p>
                    </div>
                </div>
            </div>
        </div>

        <br/>

    </div>
    <Footer/>
</div>
  )
}
